---
kind: method
id: M:Autodesk.Revit.DB.Family.CanHaveStructuralSection
zh: 族
source: html/75ba21e6-72ec-de95-5e45-8d20630260e3.htm
---
# Autodesk.Revit.DB.Family.CanHaveStructuralSection Method

**中文**: 族

Identifies if this Family can have a structural section.

## Syntax (C#)
```csharp
public bool CanHaveStructuralSection()
```

## Returns
True if the Family can have structural section, false otherwise.